# -*- coding: utf-8 -*-

# 格式化字符串

#——————————————————————————————————————————————

print """
———————————————————————————————————————#3_21_格式化字符串基本——————————————————————————————————————————————
"""
k = "uid"
v = "sa"
print "%s=%s"%(k,v) #(k,v)表示一个tuple

#——————————————————————————————————————————————

print """
———————————————————————————————————————#3_22_字符串格式化和字符串连接的比较——————————————————————————————————————————————
"""

uid = "sa"
pwd = "secret"
print pwd + " is not a good password for " + uid
print "%s is not a good password for %s" % (pwd, uid)

userCount = 6
print "Users connected: %d" % (userCount,)
# print "Users connected: " + userCount  #报错

"""
|字符串格式化不只是连接，它甚至不仅仅是格式化，它也是强制类型转换，上面的例子就是把int转换成了str，如果用+则会报错

|这里的(userCount,)表示是一个只包含一个元素的tuple，会显得有点奇怪，不过这是为了明确显示这是一个tuple
 -|当定义一个list、tuple或者dictionary的时候，在最后一个元素后边可以有选择性的增加一个逗号
 —|当定义一个仅只包含一个元素的tuple时，最后的逗号是必须的
 -|如果省略号，Python会不知道(userCount)是一个变量userCount的值，还是一个仅包含一个元素的tuple

|字符串格式化，通过把%s替换成%d就可以处理整数

|字符串连接，只能在被连接的每一个都是字符串的时候起作用
"""

#——————————————————————————————————————————————

print """
———————————————————————————————————————#3_23_数值格式化——————————————————————————————————————————————
"""

print "Today's stock price: %f" %50.4625
print "Today's stock price: %.2f" % 50.4625
print "Change since yesterday: %+.2f" % 1.5

"""
|%f对应一个十进制浮点数，精度默认是小数点后六位

|使用.2指定浮点数的精度为小数点后2位，如果浮点数小数位不全则补全
"""
